TensorFlowFoam/misc/Other_models/ML_RNG/ML_RNG_Run/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam_ML;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         6000;

deltaT          1;

writeControl    timeStep;

writeInterval  	1000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    //#includeFunc "stressComponents"
   // #includeFunc "pressureCoefficient"
   // #includeFunc "sample"
   // #includeFunc "sampleCp"
   // #includeFunc "writeCellCentres"
   // #includeFunc "wallShearStress"
}

libs
(
  "ML_RNG.so"
);

// ************************************************************************* //

