TensorFlowFoam/misc/Other_models/ML_RNG/ML_RNG_Run/system/stressComponents
type            turbulenceFields;
libs            ("libfieldFunctionObjects.so");

writeControl    writeTime;

fields          (devReff);

